In [1]:
%load_ext sql

# put a folder and DB credential files at HOME directory

import os
homedir = os.getcwd()
cred_path = os.path.join(homedir, 'db_cred')



# add a 'cred_path' for interpreter to search
import sys
sys.path.append(cred_path)



# import DB credentials from 'gpdb_credentials.py' dictionary file.
from gpdb_credentials import dvdrental_db



# parsing DB credentials and connect to Greenplum using %sql $connection_string

username = dvdrental_db['Username']
password = dvdrental_db['Password']
host = dvdrental_db['Host']
port = dvdrental_db['Port']
database = dvdrental_db['Database']

connection_string = 'postgresql://{user}:{password}@{host}:{port}/{db}'.format(
user=username,
password=password,
host=host,
port=port,
db=database)

%sql $connection_string

'Connected: myuser@dvdrental'

# FULL OUTER JOIN

- INNER / LEFT OUTER / RIGHT OUTER JOIN의 결과를 모두 출력하는 JOIN
- 즉 N개의 테이블 사이에서 출력가능한 모든 데이터에 대한 집합을 출력한다.

![image](https://user-images.githubusercontent.com/74717033/131220257-fee16316-241d-47e1-a0ee-eba57e61f787.png)

In [2]:
%%sql

SELECT
       A.ID ID_A
     , A.FRUIT FRUIT_A
     , B.ID ID_B
     , B.FRUIT FRUIT_B
FROM BASKET_A A
FULL OUTER JOIN 
	 BASKET_B B 
ON A.FRUIT = B.FRUIT;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
6 rows affected.

[(1, 'Apple', 2, 'Apple'),
 (2, 'Orange', 1, 'Orange'),
 (3, 'Banana', None, None),
 (4, 'Cucumber', None, None),
 (None, None, 3, 'Watermelon'),
 (None, None, 4, 'Pear')]

# 예제 1. FULL OUTER - ONLY OUTER

- 기본적인 FULL OUTER JOIN에서 LEFT OUTER (B.ID IS NULL) 과 RIGHT OUTER(A.ID IS NULL) 만 추출 한 것

![image](https://user-images.githubusercontent.com/74717033/131220540-62f0aea2-7f16-4e1f-abdb-5409039eceb6.png)

In [3]:
%%sql

SELECT
       A.ID ID_A
     , A.FRUIT FRUIT_A
     , B.ID ID_B
     , B.FRUIT FRUIT_B
FROM BASKET_A A -- BASKET_A 테이블과
FULL OUTER JOIN BASKET_B B -- BASKET_B 테이블을
ON A.FRUIT = B.FRUIT -- FRUIT 컬럼 기준으로 FULL OUTER JOIN 하는데
WHERE  A.ID IS NULL -- right outer (A.ID 가 NULL인값) 혹은
   OR  B.ID IS NULL; --left outer (B.ID가 NULL인 값) 인 집합을 출력하라

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
4 rows affected.

[(3, 'Banana', None, None),
 (4, 'Cucumber', None, None),
 (None, None, 3, 'Watermelon'),
 (None, None, 4, 'Pear')]

# JOIN용 실습 테이블 추가 생성

> 테이블 생성

```PYTHON
CREATE TABLE
IF NOT EXISTS DEPARTMENTS2 -- postgreSQl 문법 : 존재하지 않으면 생성(존재 하면 생성 X)
(
  DEPARTMENT_ID SERIAL PRIMARY KEY
, DEPARTMENT_NAME VARCHAR (255) NOT NULL
);

CREATE TABLE
IF NOT EXISTS EMPLOYEES2 
(
  EMPLOYEE_ID SERIAL PRIMARY KEY
, EMPLOYEE_NAME VARCHAR (255)
, DEPARTMENT_ID INTEGER
);
```

> 데이터 입력
```python
INSERT INTO DEPARTMENTS2 (DEPARTMENT_NAME)
VALUES
  ('Sales')
, ('Marketing')
, ('HR')
, ('IT')
, ('Production');

COMMIT;

SELECT * FROM DEPARTMENTS2; 

INSERT INTO EMPLOYEES2 (
  EMPLOYEE_NAME
, DEPARTMENT_ID
)
VALUES
('Bette Nicholson', 1),
('Christian Gable', 1),
('Joe Swank', 2),
('Fred Costner', 3),
('Sandra Kilmer', 4),
('Julia Mcqueen', NULL);

SELECT  * FROM EMPLOYEES2; 
COMMIT; 
```

In [4]:
%%sql

select * from departments;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Sales'), (2, 'Marketing'), (3, 'HR'), (4, 'IT'), (5, 'Production')]

In [5]:
%%sql

select * from employees;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
22 rows affected.

[(1, 'Bette Nicholson', 1),
 (2, 'Christian Gable', 1),
 (3, 'Joe Swank', 2),
 (4, 'Fred Costner', 3),
 (5, 'Sandra Kilmer', 4),
 (6, 'Julia Mcqueen', None),
 (7, 'Joyce Edwards', None),
 (8, 'Diane Collins', None),
 (9, 'Alice Stewart', None),
 (10, 'Julie Sanchez', None),
 (11, 'Heather Morris', None),
 (12, 'Teresa Rogers', None),
 (13, 'Doris Reed', None),
 (14, 'Gloria Cook', None),
 (15, 'Evelyn Morgan', None),
 (16, 'Jean Bell', None),
 (17, 'Bette Nicholson', 1),
 (18, 'Christian Gable', 1),
 (19, 'Joe Swank', 2),
 (20, 'Fred Costner', 3),
 (21, 'Sandra Kilmer', 4),
 (22, 'Julia Mcqueen', None)]

# 예제 2. FULL OUTER JOIN 실습2

![image](https://user-images.githubusercontent.com/74717033/131221451-c934b410-487d-4d28-973d-99893e0c5d2a.png)

- LEFT OUTER JOIN : 소속된 부서가 없는 직원
- RIGHT OUTER JOIN : 소속한 직원이 없는 부서

In [6]:
%%sql

SELECT 
    E.EMPLOYEE_NAME,
    D.DEPARTMENT_NAME
FROM
    EMPLOYEES2 E -- EMPLOYEES 테이블과
FULL OUTER JOIN DEPARTMENTS2 D -- DEPARTMENTS 테이블을 
ON D.DEPARTMENT_ID = E.DEPARTMENT_ID; -- FULL OUTER JOIN 한다.

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
7 rows affected.

[('BETTE NICHOLSON', 'SALES'),
 ('CHRISTIAN GABLE', 'SALES'),
 ('JOE SWANK', 'MARKETING'),
 ('FRED COSTNER', 'HR'),
 ('SANDRA KILMER', 'IT'),
 ('JULIA MCQUEEN', None),
 (None, 'PRODUCTION')]

# 예제 3. FULL OUTER JOIN - RIGHT ONLY 

- FULL OUTER + RIGHT ONLY 는 RIGHT OUTER + RIGHT ONLY 를 한 결과이다.
- LEFT TABLE의 값이 NULL인 조건이 RIGHT ONLY 이다.

![image](https://user-images.githubusercontent.com/74717033/131222265-89d1a2d7-2085-47e9-80b7-0c53a5664986.png)

## 소속한 직원이 없는 부서만 출력하기

FULL OUTER JOIN으로 RIGHT ONLY 출력하기

In [7]:
%%sql

SELECT
       E.EMPLOYEE_NAME
     , D.DEPARTMENT_NAME
  FROM
       EMPLOYEES2 E -- EMPLOYEES2 테이블과
FULL OUTER JOIN DEPARTMENTS2 D -- DEPARTMENTS2 테이블을 
   ON D.DEPARTMENT_ID = E.DEPARTMENT_ID -- FULL OUTER 조인 한다.
WHERE D. DEPARTMENT_ID IS NULL; -- RIGHT ONLY 조건으로

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[('JULIA MCQUEEN', None)]

RIGHT OUTER JOIN으로 RIGHT ONLY 출력하기

In [8]:
%%sql

SELECT
    E.EMPLOYEE_NAME,
    D.DEPARTMENT_NAME
FROM
    EMPLOYEES2 E
RIGHT JOIN DEPARTMENTS2 D
    ON D.DEPARTMENT_ID = E.DEPARTMENT_ID
WHERE
    E.EMPLOYEE_NAME IS NULL;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
1 rows affected.

[(None, 'PRODUCTION')]